cask_args appdir: "/Applications", fontdir: "/Library/Fonts"

# Third-party repos (tap)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "heroku/brew"

# Homebrew installs (brew)
brew "coreutils" # needed for the repo setup script
brew "git"
brew "gnupg"
brew "heroku"
brew "mackup"
brew "mas" # mas-cli needed to install mac apps below
brew "node"
brew "nvm"
brew "vim"
brew "wget"
brew "youtube-dl"

# Homebrew extensions (cask)
cask "1password"
cask "alfred"
cask "atom"
cask "authy"
cask "cleanmymac"
cask "cleanshot"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "iterm2"
cask "obs"
cask "sketch"
cask "spotify"
cask "transmit"
cask "visual-studio-code"
cask "zoom"

# cask "browserstacklocal"
# cask "evernote"
# cask "mamp"
# cask "moom"
# cask "nordvpn"
# cask "pdf-squeezer"
# cask "signal"
# cask "sip"
# cask "slack"
# cask "transmission"
# cask "whatsapp"
# cask "xscope"

# Mac App Store (mas)
mas "Evernote", id: 406056744
mas "GIF Brewery", id: 1081413713
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "MindNode", id: 1289197285
mas "Moom", id: 419330170
mas "NordVPN", id: 1116599239
mas "PDF Squeezer 4", id: 1502111349
mas "Sip", id: 507257563
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723

# mas "Logic Pro", id: 634148309
# mas "Final Cut Pro", id: 424389933
